python3/netaddr.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-11-19 Mon 16:32 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>netaddr</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Hao Ruan">
<link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
<link href="../org-html-themes/css/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">netaddr</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgfe6719d">1. 概述</a></li>
<li><a href="#org163eabb">2. IP 地址操作</a>
<ul>
<li><a href="#orgcda267a">2.1. 定义网络</a></li>
<li><a href="#org5f1c159">2.2. 网络掩码</a></li>
<li><a href="#org903ff92">2.3. 广播地址</a></li>
<li><a href="#org149a80b">2.4. 网络地址</a></li>
<li><a href="#org0fbc4da">2.5. 主机掩码</a></li>
<li><a href="#orga3402e7">2.6. 网段包含主机数量</a></li>
<li><a href="#org8ad5986">2.7. 获取所有主机地址</a></li>
<li><a href="#org26d87ec">2.8. 将 IP 地址所在网段根据掩码长度划分子网</a></li>
<li><a href="#org67f3761">2.9. 修改掩码长度</a></li>
<li><a href="#org9f32aad">2.10. 判断公私网</a></li>
<li><a href="#orge4ab0fb">2.11. 定义网段地址范围</a></li>
<li><a href="#org3e72dc0">2.12. 地址聚合</a>
<ul>
<li><a href="#org62dcb9d">2.12.1. IPRange</a></li>
<li><a href="#orgf624712">2.12.2. cidr_merge</a></li>
</ul>
</li>
<li><a href="#orgc7e2105">2.13. 地址加减</a></li>
<li><a href="#orgcb5d89d">2.14. MAC 地址操作</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgfe6719d">1. 概述</a></li>
<li><a href="#org163eabb">2. IP 地址操作</a>
<ul>
<li><a href="#orgcda267a">2.1. 定义网络</a></li>
<li><a href="#org5f1c159">2.2. 网络掩码</a></li>
<li><a href="#org903ff92">2.3. 广播地址</a></li>
<li><a href="#org149a80b">2.4. 网络地址</a></li>
<li><a href="#org0fbc4da">2.5. 主机掩码</a></li>
<li><a href="#orga3402e7">2.6. 网段包含主机数量</a></li>
<li><a href="#org8ad5986">2.7. 获取所有主机地址</a></li>
<li><a href="#org26d87ec">2.8. 将 IP 地址所在网段根据掩码长度划分子网</a></li>
<li><a href="#org67f3761">2.9. 修改掩码长度</a></li>
<li><a href="#org9f32aad">2.10. 判断公私网</a></li>
<li><a href="#orge4ab0fb">2.11. 定义网段地址范围</a></li>
<li><a href="#org3e72dc0">2.12. 地址聚合</a>
<ul>
<li><a href="#org62dcb9d">2.12.1. IPRange</a></li>
<li><a href="#orgf624712">2.12.2. cidr_merge</a></li>
</ul>
</li>
<li><a href="#orgc7e2105">2.13. 地址加减</a></li>
<li><a href="#orgcb5d89d">2.14. MAC 地址操作</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class="outline-2" id="meta">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">Author</td>
<td class="org-left">Hao Ruan (haoru@cisco.com)</td>
</tr>

<tr>
<td class="org-left">Date</td>
<td class="org-left">2018-11-19 16:32:40</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-orgfe6719d" class="outline-2">
<h2 id="orgfe6719d"><span class="section-number-2">1</span> 概述</h2>
<div class="outline-text-2" id="text-1">
<p>
netaddr 模块用于处理 IP 地址和 MAC 地址，它有两个基本类：IPAddress 和 IPNetwork。
</p>
</div>
</div>

<div id="outline-container-org163eabb" class="outline-2">
<h2 id="org163eabb"><span class="section-number-2">2</span> IP 地址操作</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgcda267a" class="outline-3">
<h3 id="orgcda267a"><span class="section-number-3">2.1</span> 定义网络</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #d787d7; font-weight: bold;">from</span> netaddr <span style="color: #d787d7; font-weight: bold;">import</span> IPAddress, IPNetwork
<span style="color: #5fafff;">nw</span> = IPNetwork<span style="color: #ff8c00; font-size: 150%;">(</span><span style="color: #87af5f;">'192.168.0.1/24'</span><span style="color: #ff8c00; font-size: 150%;">)</span>
<span style="color: #d787d7; font-weight: bold;">print</span><span style="color: #ff8c00; font-size: 150%;">(</span>nw<span style="color: #ff8c00; font-size: 150%;">)</span>
</pre>
</div>

<pre class="example">
192.168.0.1/24

</pre>
</div>
</div>


<div id="outline-container-org5f1c159" class="outline-3">
<h3 id="org5f1c159"><span class="section-number-3">2.2</span> 网络掩码</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #d787d7; font-weight: bold;">print</span><span style="color: #ff8c00; font-size: 150%;">(</span>nw.netmask<span style="color: #ff8c00; font-size: 150%;">)</span>
</pre>
</div>

<pre class="example">
255.255.255.0

</pre>
</div>
</div>


<div id="outline-container-org903ff92" class="outline-3">
<h3 id="org903ff92"><span class="section-number-3">2.3</span> 广播地址</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #d787d7; font-weight: bold;">print</span><span style="color: #ff8c00; font-size: 150%;">(</span>nw.broadcast<span style="color: #ff8c00; font-size: 150%;">)</span>
</pre>
</div>

<pre class="example">
192.168.0.255

</pre>
</div>
</div>


<div id="outline-container-org149a80b" class="outline-3">
<h3 id="org149a80b"><span class="section-number-3">2.4</span> 网络地址</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #d787d7; font-weight: bold;">print</span><span style="color: #ff8c00; font-size: 150%;">(</span>nw.network<span style="color: #ff8c00; font-size: 150%;">)</span>
</pre>
</div>

<pre class="example">
192.168.0.0

</pre>
</div>
</div>


<div id="outline-container-org0fbc4da" class="outline-3">
<h3 id="org0fbc4da"><span class="section-number-3">2.5</span> 主机掩码</h3>
<div class="outline-text-3" id="text-2-5">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #d787d7; font-weight: bold;">print</span><span style="color: #ff8c00; font-size: 150%;">(</span>nw.hostmask<span style="color: #ff8c00; font-size: 150%;">)</span>
</pre>
</div>

<pre class="example">
0.0.0.255

</pre>
</div>
</div>


<div id="outline-container-orga3402e7" class="outline-3">
<h3 id="orga3402e7"><span class="section-number-3">2.6</span> 网段包含主机数量</h3>
<div class="outline-text-3" id="text-2-6">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #d787d7; font-weight: bold;">print</span><span style="color: #ff8c00; font-size: 150%;">(</span>nw.size<span style="color: #ff8c00; font-size: 150%;">)</span>
</pre>
</div>

<pre class="example">
256

</pre>
</div>
</div>


<div id="outline-container-org8ad5986" class="outline-3">
<h3 id="org8ad5986"><span class="section-number-3">2.7</span> 获取所有主机地址</h3>
<div class="outline-text-3" id="text-2-7">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #d787d7; font-weight: bold;">import</span> itertools
<span style="color: #d787d7; font-weight: bold;">print</span><span style="color: #ff8c00; font-size: 150%;">(</span><span style="color: #5fafff; font-weight: bold;">list</span><span style="color: #ff1493; font-size: 140%;">(</span>itertools.islice<span style="color: #7fff00; font-size: 130%;">(</span>nw.iter_hosts<span style="color: #00bfff; font-size: 120%;">()</span>, 3<span style="color: #7fff00; font-size: 130%;">)</span><span style="color: #ff1493; font-size: 140%;">)</span><span style="color: #ff8c00; font-size: 150%;">)</span>
</pre>
</div>

<pre class="example">
[IPAddress('192.168.0.1'), IPAddress('192.168.0.2'), IPAddress('192.168.0.3')]

</pre>
</div>
</div>


<div id="outline-container-org26d87ec" class="outline-3">
<h3 id="org26d87ec"><span class="section-number-3">2.8</span> 将 IP 地址所在网段根据掩码长度划分子网</h3>
<div class="outline-text-3" id="text-2-8">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #5fafff;">subnets</span> = <span style="color: #ff8c00; font-size: 150%;">[</span>x <span style="color: #d787d7; font-weight: bold;">for</span> x <span style="color: #d787d7; font-weight: bold;">in</span> nw.subnet<span style="color: #ff1493; font-size: 140%;">(</span>30<span style="color: #ff1493; font-size: 140%;">)</span><span style="color: #ff8c00; font-size: 150%;">]</span> <span style="color: #707070; font-style: italic;"># </span><span style="color: #707070; font-style: italic;">&#20998;&#20026;&#25513;&#30721;&#38271;&#24230;&#20026; 30 &#30340;&#20960;&#20010;&#23376;&#32593;</span>
<span style="color: #d787d7; font-weight: bold;">print</span><span style="color: #ff8c00; font-size: 150%;">(</span>subnets<span style="color: #ff1493; font-size: 140%;">[</span>:3<span style="color: #ff1493; font-size: 140%;">]</span><span style="color: #ff8c00; font-size: 150%;">)</span>
</pre>
</div>

<pre class="example">
[IPNetwork('192.168.0.0/30'), IPNetwork('192.168.0.4/30'), IPNetwork('192.168.0.8/30')]

</pre>
</div>
</div>


<div id="outline-container-org67f3761" class="outline-3">
<h3 id="org67f3761"><span class="section-number-3">2.9</span> 修改掩码长度</h3>
<div class="outline-text-3" id="text-2-9">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #5fafff;">nw.prefixlen</span> = 28
<span style="color: #d787d7; font-weight: bold;">print</span><span style="color: #ff8c00; font-size: 150%;">(</span>nw<span style="color: #ff8c00; font-size: 150%;">)</span>
</pre>
</div>

<pre class="example">
192.168.0.1/28

</pre>
</div>
</div>


<div id="outline-container-org9f32aad" class="outline-3">
<h3 id="org9f32aad"><span class="section-number-3">2.10</span> 判断公私网</h3>
<div class="outline-text-3" id="text-2-10">
<div class="org-src-container">
<pre class="src src-ipython">log<span style="color: #ff8c00; font-size: 150%;">(</span><span style="color: #87af5f;">"IPAddress('10.74.68.58').is_private()"</span>, IPAddress<span style="color: #ff1493; font-size: 140%;">(</span><span style="color: #87af5f;">'10.74.68.58'</span><span style="color: #ff1493; font-size: 140%;">)</span>.is_private<span style="color: #ff1493; font-size: 140%;">()</span><span style="color: #ff8c00; font-size: 150%;">)</span>
log<span style="color: #ff8c00; font-size: 150%;">(</span><span style="color: #87af5f;">"IPAddress('1.1.1.2').is_private()"</span>, IPAddress<span style="color: #ff1493; font-size: 140%;">(</span><span style="color: #87af5f;">'1.1.1.2'</span><span style="color: #ff1493; font-size: 140%;">)</span>.is_private<span style="color: #ff1493; font-size: 140%;">()</span><span style="color: #ff8c00; font-size: 150%;">)</span>
</pre>
</div>

<pre class="example">
 IPAddress('10.74.68.58').is_private()
True
 IPAddress('1.1.1.2').is_private()
False

</pre>
</div>
</div>


<div id="outline-container-orge4ab0fb" class="outline-3">
<h3 id="orge4ab0fb"><span class="section-number-3">2.11</span> 定义网段地址范围</h3>
<div class="outline-text-3" id="text-2-11">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #d787d7; font-weight: bold;">from</span> netaddr <span style="color: #d787d7; font-weight: bold;">import</span> IPRange
<span style="color: #5fafff;">ipRange</span> = IPRange<span style="color: #ff8c00; font-size: 150%;">(</span><span style="color: #87af5f;">'192.168.1.10'</span>, <span style="color: #87af5f;">'192.168.1.130'</span><span style="color: #ff8c00; font-size: 150%;">)</span>
<span style="color: #d787d7; font-weight: bold;">print</span><span style="color: #ff8c00; font-size: 150%;">(</span>ipRange<span style="color: #ff8c00; font-size: 150%;">)</span>
</pre>
</div>

<pre class="example">
192.168.1.10-192.168.1.130

</pre>
</div>
</div>


<div id="outline-container-org3e72dc0" class="outline-3">
<h3 id="org3e72dc0"><span class="section-number-3">2.12</span> 地址聚合</h3>
<div class="outline-text-3" id="text-2-12">
</div>
<div id="outline-container-org62dcb9d" class="outline-4">
<h4 id="org62dcb9d"><span class="section-number-4">2.12.1</span> IPRange</h4>
<div class="outline-text-4" id="text-2-12-1">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #d787d7; font-weight: bold;">print</span><span style="color: #ff8c00; font-size: 150%;">(</span>ipRange.cidrs<span style="color: #ff1493; font-size: 140%;">()</span><span style="color: #ff8c00; font-size: 150%;">)</span>
</pre>
</div>

<pre class="example">
[IPNetwork('192.168.1.10/31'), IPNetwork('192.168.1.12/30'), IPNetwork('192.168.1.16/28'), IPNetwork('192.168.1.32/27'), IPNetwork('192.168.1.64/26'), IPNetwork('192.168.1.128/31'), IPNetwork('192.168.1.130/32')]

</pre>
</div>
</div>


<div id="outline-container-orgf624712" class="outline-4">
<h4 id="orgf624712"><span class="section-number-4">2.12.2</span> cidr_merge</h4>
<div class="outline-text-4" id="text-2-12-2">
<p>
这个方法可以用于路由汇总的计算
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #d787d7; font-weight: bold;">from</span> netaddr <span style="color: #d787d7; font-weight: bold;">import</span> cidr_merge
<span style="color: #5fafff;">ip_list</span> = <span style="color: #ff8c00; font-size: 150%;">[]</span>
ip_list.append<span style="color: #ff8c00; font-size: 150%;">(</span>IPNetwork<span style="color: #ff1493; font-size: 140%;">(</span><span style="color: #87af5f;">"192.168.1.0/25"</span><span style="color: #ff1493; font-size: 140%;">)</span><span style="color: #ff8c00; font-size: 150%;">)</span>
ip_list.append<span style="color: #ff8c00; font-size: 150%;">(</span>IPNetwork<span style="color: #ff1493; font-size: 140%;">(</span><span style="color: #87af5f;">"192.168.1.128/25"</span><span style="color: #ff1493; font-size: 140%;">)</span><span style="color: #ff8c00; font-size: 150%;">)</span>
ip_list.append<span style="color: #ff8c00; font-size: 150%;">(</span>IPNetwork<span style="color: #ff1493; font-size: 140%;">(</span><span style="color: #87af5f;">"192.168.0.0/24"</span><span style="color: #ff1493; font-size: 140%;">)</span><span style="color: #ff8c00; font-size: 150%;">)</span>
ip_list.append<span style="color: #ff8c00; font-size: 150%;">(</span>IPNetwork<span style="color: #ff1493; font-size: 140%;">(</span><span style="color: #87af5f;">"192.168.3.0/26"</span><span style="color: #ff1493; font-size: 140%;">)</span><span style="color: #ff8c00; font-size: 150%;">)</span>
ip_list.append<span style="color: #ff8c00; font-size: 150%;">(</span>IPNetwork<span style="color: #ff1493; font-size: 140%;">(</span><span style="color: #87af5f;">"192.168.3.64/26"</span><span style="color: #ff1493; font-size: 140%;">)</span><span style="color: #ff8c00; font-size: 150%;">)</span>
<span style="color: #d787d7; font-weight: bold;">print</span><span style="color: #ff8c00; font-size: 150%;">(</span>cidr_merge<span style="color: #ff1493; font-size: 140%;">(</span>ip_list<span style="color: #ff1493; font-size: 140%;">)</span><span style="color: #ff8c00; font-size: 150%;">)</span>

</pre>
</div>

<pre class="example">
[IPNetwork('192.168.0.0/23'), IPNetwork('192.168.3.0/25')]

</pre>
</div>
</div>
</div>


<div id="outline-container-orgc7e2105" class="outline-3">
<h3 id="orgc7e2105"><span class="section-number-3">2.13</span> 地址加减</h3>
<div class="outline-text-3" id="text-2-13">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #5fafff;">ip</span> = IPAddress<span style="color: #ff8c00; font-size: 150%;">(</span><span style="color: #87af5f;">'172.20.1.1'</span><span style="color: #ff8c00; font-size: 150%;">)</span>
<span style="color: #5fafff;">ip</span> += 256
<span style="color: #d787d7; font-weight: bold;">print</span><span style="color: #ff8c00; font-size: 150%;">(</span>ip<span style="color: #ff8c00; font-size: 150%;">)</span>
<span style="color: #5fafff;">ip</span> -= 3
<span style="color: #d787d7; font-weight: bold;">print</span><span style="color: #ff8c00; font-size: 150%;">(</span>ip<span style="color: #ff8c00; font-size: 150%;">)</span>

</pre>
</div>

<pre class="example">
172.20.2.1
172.20.1.254

</pre>
</div>
</div>






<div id="outline-container-orgcb5d89d" class="outline-3">
<h3 id="orgcb5d89d"><span class="section-number-3">2.14</span> MAC 地址操作</h3>
<div class="outline-text-3" id="text-2-14">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #d787d7; font-weight: bold;">from</span> netaddr <span style="color: #d787d7; font-weight: bold;">import</span> *
<span style="color: #5fafff;">mac</span> = EUI<span style="color: #ff8c00; font-size: 150%;">(</span><span style="color: #87af5f;">'98:5a:eb:9f:35:f8'</span><span style="color: #ff8c00; font-size: 150%;">)</span>
<span style="color: #5fafff;">mac.dialect</span> = mac_unix
log<span style="color: #ff8c00; font-size: 150%;">(</span><span style="color: #87af5f;">"unix mac"</span>, mac<span style="color: #ff8c00; font-size: 150%;">)</span>
<span style="color: #5fafff;">mac.dialect</span> = mac_cisco
log<span style="color: #ff8c00; font-size: 150%;">(</span><span style="color: #87af5f;">"cisco mac"</span>, mac<span style="color: #ff8c00; font-size: 150%;">)</span>
<span style="color: #5fafff;">mac.dialect</span> = mac_bare
log<span style="color: #ff8c00; font-size: 150%;">(</span><span style="color: #87af5f;">"bare mac"</span>, mac<span style="color: #ff8c00; font-size: 150%;">)</span>
log<span style="color: #ff8c00; font-size: 150%;">(</span><span style="color: #87af5f;">"mac.info"</span>, mac.info<span style="color: #ff8c00; font-size: 150%;">)</span> <span style="color: #707070; font-style: italic;"># </span><span style="color: #707070; font-style: italic;">&#33719;&#21462;&#21378;&#23478;&#20449;&#24687;</span>
</pre>
</div>

<pre class="example">
==================== unix mac ====================
98:5a:eb:9f:35:f8
=================== cisco mac ====================
985a.eb9f.35f8
==================== bare mac ====================
985AEB9F35F8
==================== mac.info ====================
{'OUI': {'address': ['1 Infinite Loop', 'Cupertino  CA  95014', 'US'],
 'idx': 9984747,
 'offset': 750381,
 'org': 'Apple, Inc.',
 'oui': '98-5A-EB',
 'size': 123}}
</pre>
</div>
</div>
</div>
</div>
</body>
</html>